[
    {
        "rating": "8.0",
        "year": "2025",
        "genres": ["Chính Kịch", "Hành Động", "Gay Cấn", "Tâm Lý", "Nghề Nghiệp"],
        "description": "Nhà đàm phán huyền thoại Yoon Joo No trở thành trưởng nhóm Mua bán và Sáp nhập của tập đoàn Sanin. Từ đó, ta sẽ được thấy mỗi thương vụ là mỗi cuộc chiến và và mỗi nhân vật là một đối thủ đáng gờm.",
        "duration": "1h 10m",
        "country": "Hàn Quốc",
        "directors": ["Ahn Pan-seok"],
        "actors": ["Lee Je-hoon", "Kim Dae-myung", "Sung Dong-il", "Jang Hyun-sung", "Oh Man-seok", "Ahn Hyun-ho"],
        "id": 1,
        "title": "Bậc Thầy Đàm Phán",
        "videoUrl": "media/Moi phat hanh/Bậc Thầy Đàm Phán/Bac_Thay_Dam_Phan.mp4",
        "posterUrl": "media/Moi phat hanh/Bậc Thầy Đàm Phán/f3cad543652e3b03b732235bbd174e1c.webp"
    },
    {
        "rating": "7.2",
        "year": "2025",
        "genres": ["Chính Kịch", "Tình Cảm", "Đời Thường", "Hài"],
        "description": "Các bác sĩ nội trú sản phụ khoa năm nhất tại Bệnh viện Yulje phải vượt qua vô số hỗn loạn trong công việc và đời tư để trở thành những bác sĩ xuất sắc.",
        "duration": "1h 10m",
        "country": "Hàn Quốc",
        "directors": ["Shin Won-ho", "Lee Woo-jung"],
        "actors": ["Go Youn-jung", "Shin Si-a", "Kang Yoo-seok", "Jung Jun-won", "Lee Chang-hoon", "Jung Woon-sun"],
        "id": 2,
        "title": "Chuyện Đời Bác Sĩ Nội Trú",
        "videoUrl": "media/Moi phat hanh/Chuyện Đời Bác Sĩ Nội Trú/Chuyen_Doi_Bac_Si_Noi_Tru.mp4",
        "posterUrl": "media/Moi phat hanh/Chuyện Đời Bác Sĩ Nội Trú/e59519897d849aaac2a36f6512d65f68.webp"
    },
    {
        "rating": "8.9",
        "year": "2025",
        "genres": ["Hoàng Cung", "Chính Kịch", "Tình Cảm", "Cổ Trang", "Kỳ Ảo", "Lãng Mạn"],
        "description": "Cung Điện Ma Ám (The Haunted Palace) xoay quanh chuyện tình nhuốm màu thần bí giữa một thư sinh bị ma ám và một nữ pháp sư. Vốn là một thư sinh thông minh được vua xem trọng, cuộc đời Yun Gap bỗng đảo lộn khi cơ thể bị ác thần xâm chiếm. Người duy nhất thấy được ác thần này là Yeo Ri, cháu gái của một pháp sư nổi tiếng. Dù sở hữu sức mạnh tâm linh lớn từ khi mới sinh, cô luôn chối bỏ tài năng của mình và chỉ muốn làm người thường. Nhưng khi biết tin Yun Gap gặp nạn, Yeo Ri quyết định kế nghiệp ông và trở thành pháp sư trừ yêu diệt ma.",
        "duration": "1h 00m",
        "country": "Hàn Quốc",
        "directors": ["Yoon Soo-Jung"],
        "actors": ["Yook Sung-jae", "Bona", "Kim Ji-hun", "Kil Hae-yeon", "Kim Sang-ho", "Shin Seul-ki", "Son Byung-ho", "Han So-eun"],
        "id": 3,
        "title": "Cung Điện Ma Ám",
        "videoUrl": "media/Moi phat hanh/Cung Điện Ma Ám/Cung_Dien_Ma_Am.mp4",
        "posterUrl": "media/Moi phat hanh/Cung Điện Ma Ám/5435e324d4d2f29bb00f82b423a84bb0.webp"
    },
    {
        "rating": "9.3",
        "year": "2025",
        "genres": ["Chính Kịch", "Tình Cảm", "Cổ Điển", "Tâm Lý", "Lãng Mạn"],
        "description": "Ở Jeju, câu chuyện về một cô nàng nhiệt huyết và chàng trai kiên cường trên đảo nảy nở thành câu chuyện trọn đời đầy thăng trầm, minh chứng tình yêu vẫn trường tồn theo thời gian.",
        "duration": "1h 00m",
        "country": "Hàn Quốc",
        "directors": ["Im Sang-choon", "Kim Won-suk"],
        "actors": ["IU", "Park Bo-gum", "Moon So-ri", "Park Hae-jun"],
        "id": 4,
        "title": "Khi Cuộc Đời Cho Bạn Quả Quýt",
        "videoUrl": "media/Moi phat hanh/Khi Cuộc Đời Cho Bạn Quả Quýt/Khi_Cuoc_Doi_Cho_Ban_Qua_Quyt.mp4",
        "posterUrl": "media/Moi phat hanh/Khi Cuộc Đời Cho Bạn Quả Quýt/f9197908357fe5ff6b4887a2752bf6ef.webp"
    },
    {
        "rating": "8.5",
        "year": "2025",
        "genres": ["Chính Kịch", "Tình Cảm", "Tâm Lý", "Lãng Mạn", "Chuyển Thể"],
        "description": "Bộ phim chuyển thể từ tiểu thuyết cùng tên của Trúc Dĩ, kể về cuộc sống vô tình thuê chung nhà của Ôn Dĩ Phàm và Tang Diên - một bạn học cấp ba từng bị cô từ chối. Hai người nước sông không phạm nước giếng, nhưng chỉ vì Tang Diên nói với Ôn Dĩ Phàm rằng cô bị mộng du mà hai người đã nảy sinh ra rất nhiều chuyện phía sau đó.",
        "duration": "40m",
        "country": "Trung Quốc",
        "directors": ["Zhu Yi"],
        "actors": ["Bai Jingting", "Zhang Ruonan", "Edward Chen", "Zhang Miaoyi", "Zhai Xiaowen"],
        "id": 5,
        "title": "Khó Dỗ Dành",
        "videoUrl": "media/Moi phat hanh/Khó Dỗ Dành/Kho_Do_Danh.mp4",
        "posterUrl": "media/Moi phat hanh/Khó Dỗ Dành/09d00ac5a6e7f45516547538b4f0dd78.webp"
    },
    {
        "rating": "7.6",
        "year": "2025",
        "genres": ["Chính Kịch", "Hình Sự", "Bí Ẩn", "Tâm Lý"],
        "description": "Câu chuyện bắt đầu khi Seo Dong Ju, một nhân vật được mệnh danh là \"Daesan Man\" – người sống chết vì lợi ích của Tập đoàn Daesan – quyết định hack vào một quỹ đen chính trị trị giá 2 nghìn tỷ won. Đằng sau vẻ ngoài trung thành, Dong Ju ẩn chứa những tham vọng phức tạp và đầy nhiệt huyết, với mục tiêu cuối cùng là thâu tóm toàn bộ Tập đoàn Daesan khi thời cơ đến.",
        "duration": "1h 00m",
        "country": "Hàn Quốc",
        "directors": ["Lee Myung-hee"],
        "actors": ["Park Hyung-sik", "Heo Joon-ho", "Kwon Soo-hyun,\t Yoon Sang-hyeon", "Woo Hyeon"],
        "id": 6,
        "title": "Trái Tim Bị Chôn Vùi",
        "videoUrl": "media/Moi phat hanh/Trái Tim Bị Chôn Vùi/Trai_Tim_Bi_Chon_Vui.mp4",
        "posterUrl": "media/Moi phat hanh/Trái Tim Bị Chôn Vùi/6a8bc3d402e4970e58bbb273d03bd8dd.webp"
    },
    {
        "rating": "8.0",
        "year": "2025",
        "genres": ["Chính Kịch", "Khoa Học", "Kỳ Ảo", "Viễn Tưởng"],
        "description": "Về mối tình lãng mạn bị cấm đoán giữa một con quỷ báo đen của Ferry Soul và một cô gái loài người có trái tim quỷ dữ.”Vô Ưu Độ” là một bộ phim truyền hình thuộc thể loại kinh dị, lãng mạn, do Lâm Ngọc Phần đạo diễn, với sự tham gia của các diễn viên Nhậm Gia Luân , Tống Tổ Nhi và với sự cộng tác của các diễn viên khác. Bộ phim được chuyển thể từ tiểu thuyết “Bán Hạ” của Bán Minh Bán Thức, kể về câu chuyện tình yêu lãng mạn giữa Xuyên Dạ – một người thợ săn yêu quái bí ẩn và Bán Hạ – một cô gái trẻ. Trong một thế giới nơi con người và yêu quái cùng tồn tại và trải qua những câu chuyện tình ái đầy kỳ quái và hấp dẫn. Trong thành phố Quảng Bình phồn hoa, không ai biết đến sự sống dậy sóng với sự tồn tại đồng thời của con người và yêu quái. Những yêu quái khôn ngoan tinh vi, giả dạng thành người mà không ai hay biết. Bán Hạ, tiểu thư con nhà giàu, sở hữu đôi mắt đặc biệt, thường nhìn thấy những hình bóng ma không tồn tại. Bởi vì điều này, dù Bán Hạ có vâng lời và ngoan ngoãn như thế nào, cô vẫn bị mọi người nói xấu sau lưng, gọi là “người điên”. Bán Hạ đã phanh phui bí mật chị dâu vốn là quỷ, từ đó, cô liên tục bị truy sát, và thế là gặp gỡ Xuyên Dạ – một thợ săn yêu quái. Nụ hôn nhẹ nhàng của Xuyên Dạ đã mở ra một thế giới song song tồn tại của con người và yêu quái trước mắt Bán Hạ. Cả hai cùng nhau điều tra những sự việc kỳ lạ như. Mỗi ngày trôi qua, tình cảm giữa họ dần trở nên thân mật. Tuy nhiên, bí mật mà Xuyên Dạ đang mang trong lòng dần đẩy Bán Hạ ra xa, vì anh ta đã khám phá ra rằng, dù là một thợ săn yêu quái, chính anh ta cũng có khả năng trở thành một yêu quái…",
        "duration": "45m",
        "country": "Trung Quốc",
        "directors": ["Miu Wenjing"],
        "actors": ["Ren Jialun", "Song Zuer", "Xuan Yan", "Liu Ruogu", "Hei Zi", "Cao Jun", "Hani Kezi"],
        "id": 7,
        "title": "Vô Ưu Độ",
        "videoUrl": "media/Moi phat hanh/Vô Ưu Độ/Vo_Uu_Do.mp4",
        "posterUrl": "media/Moi phat hanh/Vô Ưu Độ/76ca5e560fbb92c402b0e506c5ee569c.webp"
    },
    {
        "rating": "4.4",
        "year": "2025",
        "genres": ["Chính Kịch", "Tình Cảm", "Tâm Lý", "Lãng Mạn"],
        "description": "Chàng trai Cam Dương siêu nổi trong trường đã trúng tiếng sét ái tình với Đinh Chi Đồng, cô gái luôn tất bật vội vã. Gánh nặng nợ nần khiến Đinh Chi Đồng không bao giờ dám lãng phí thời gian cho chuyện yêu đương, nhưng sự lạc quan và vui tươi của Cam Dương đã lay động cô. Đinh Chi Đồng nhận ra dù hoàn cảnh gia đình khác biệt nhưng họ lại cực kỳ ăn ý, và cô đã đồng ý hẹn hò với anh. Nhưng sự cách biệt kinh tế và hàng loạt vấn đề thực tế khi bước vào đời đã trở thành mâu thuẫn không thể lu mờ trong tình yêu ngọt ngào của hai người. Khi gia đình Cam Dương sa sút, anh che giấu sự thật và chia tay với Đinh Chi Đồng. Đinh Chi Đồng lầm tưởng mình bị ruồng bỏ, cô sốc nặng rồi lại bất ngờ gặp thêm biến cố, từ đó trở nên căm hận Cam Dương. Sáu năm sau, hai người gặp lại trong một vụ làm ăn, Đinh Chi Đồng được giao nhiệm vụ thuyết phục công ty của Cam Dương góp vốn đầu tư. Yên hận đan xen, hiểu lầm chồng chất, họ thật sự có thể vượt qua tất cả để đến với nhau ư?",
        "duration": "42m",
        "country": "Trung Quốc",
        "directors": ["Yu Zhong Zhong"],
        "actors": ["Diễn viên:"],
        "id": 8,
        "title": "Ăn Chạy Yêu",
        "videoUrl": "media/Moi phat hanh/Ăn Chạy Yêu/An_Chay_Yeu.mp4",
        "posterUrl": "media/Moi phat hanh/Ăn Chạy Yêu/0b683c030893bc2bff6970e2c2c1a631.webp"
    }
]
